# Задача 25. Написать программу преобразования десятичного числа в двоичное
def translation2(a):
    return bin(a)
print(translation2(148))
